2.2.013/src/Catalogs/МК_ЗаявкиНаОтсутствие/МК_ЗаявкиНаОтсутствие.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>МК_ЗаявкиНаОтсутствие</name>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаОтсутствия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КолвоДнейОтсутствия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусЗаявки</name>
    <type>
      <types>EnumRef.МК_СтатусыЗаявокНаОтсутствия</types>
    </type>
  </attributes>
  <attributes>
    <name>КолвоЧасовОтсутствия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Целосменный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Документ1С</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДокумента1С</name>
    <type>
      <types>CatalogRef.МК_СоответствиеОтсутствий</types>
    </type>
  </attributes>
  <attributes>
    <name>IDДокументаМК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗавершенияОтсутствия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Групповая</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЗаявки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПолученияВ1С</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

2.2.013/src/Enums/МК_СтатусыЗаявокНаОтсутствия/МК_СтатусыЗаявокНаОтсутствия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>МК_СтатусыЗаявокНаОтсутствия</name>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Выполнена</name>
  </enumValues>
  <enumValues>
    <name>Отклонена</name>
  </enumValues>
  <enumValues>
    <name>Необработана</name>
  </enumValues>
</mdclass:Enum>

2.2.013/src/Catalogs/МК_ЗаявкиНаОтсутствие/Forms/ФормаСписка/Module.bsl
&НаКлиенте
Процедура ПолучитьЗаявкиИзМК(Команда)
	ПолучитьЗаявкиИзМКНаСервере();  
	Элементы.Список.Обновить();
КонецПроцедуры


&НаСервере
Процедура ПолучитьЗаявкиИзМКНаСервере()   
	мСписДок = Справочники.МК_ЗаявкиНаОтсутствие.ПолучитьИОбработатьЗаявкиИзМК();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗадания(Команда)   
	СоздатьЗаданияНаСервере();
КонецПроцедуры

&НаСервере
Процедура СоздатьЗаданияНаСервере()
	мСписок = Новый Массив;
	Выборка = Справочники.МК_ЗаявкиНаОтсутствие.Выбрать();
	Пока Выборка.Следующий() Цикл
        Если Выборка.СтатусЗаявки = Перечисления.МК_СтатусыЗаявокНаОтсутствия.Необработана Тогда
	    	мСписок.Добавить(Выборка.Ссылка);
		КонецЕсли;
	КонецЦикла;	
	Если мСписок.Количество() > 0 Тогда      
		Справочники.МК_ЗаявкиНаОтсутствие.ОтразитьВРегистре(мСписок);		
	КонецЕсли;		
КонецПроцедуры
